/**
  ******************************************************************************
  * @file    light.h
  * @author  农业大棚监控小组
  * @version V1.0
  * @date    2024-03-07
  * @brief   光照传感器驱动头文件
  ******************************************************************************
  */

#ifndef LIGHT_H_
#define LIGHT_H_

/* 包含头文件 ----------------------------------------------------------------*/
#include "stm32f10x.h"
#include <stdint.h>
#include "kalman.h"

/* 函数声明 ------------------------------------------------------------------*/
/**
  * @brief  光照传感器模块初始化
  * @param  无
  * @retval 无
  */
void Light_Init(void);

/**
  * @brief  获取光照强度值
  * @param  无
  * @retval 0-1000范围的光照强度整数值
  */
uint16_t Light_Get(void);

#endif /* LIGHT_H_ */

/* 文件结束 -----------------------------------------------------------------*/
